imported/solids4foam/tutorials/fluidSolidInteraction/beamInCrossFlow/linearGeometryElasticBeam/constant/fluid/dynamicMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.0                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      dynamicMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dynamicFvMesh dynamicMotionSolverFvMesh;

solver velocityLaplacian; // finite volume solver
//solver laplace; // finite element solver
//solver RBFMeshMotionSolver; // radial basis function solver

diffusivity quadratic inverseDistance (interface);

// Settings for the RBF solver
// staticPatches    (top bottom left);
// movingPatches    (interface);
// fixedPatches     (inlet outlet);
// interpolation
// {
//     function     TPS;
// }
// coarsening
// {
//     enabled      no;
// }

// ************************************************************************* //
