imported/solids4foam/tutorials/fluidSolidInteraction/beamInCrossFlow/linearGeometryElasticBeam/system/functions
functions
{
    forces
    {
        type                forces;
        region              fluid;
        functionObjectLibs  ( "libforces.so" );
        outputControl       timeStep;
        outputInterval      1;
        patches             (interface);
        "pName|p"           p;
        "UName|U"           U;
        "rhoName|rho"       rhoInf;
        log                 true;
        rhoInf              1000;
        CofR                (0.5 0.1 0);
    }
}
